public/traval/experiences.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb963d52">The West Coast</a></li>
<li><a href="#org878ce18">The Prairie Provinces</a></li>
<li><a href="#orgc257b7a">Central Canada</a></li>
<li><a href="#orge335f8a">The Atlantic Region</a></li>
<li><a href="#org4d41252">The North</a></li>
</ul>
</div>
</div>
<p>
I have been lucky to travel to a variety of places in Canada. It's something that many Canadians don't get a chance to do because the price of travel in this vast country is nothing short of scandelous. Add on the high price of accommadations and food, and I can see why many people would prefer to spend their vacation dollars elsewhere.
</p>

<p>
Through various work and school opportunities, I've visted each one of Canada's main geographic regions. I'd like to share my thoughts about each place, and hopefully encourage those who can to visit them. I think this can be said about traval in general: the most valuable thing about the places I've been to is the people who call those places home.
</p>

<div id="outline-container-orgb963d52" class="outline-2">
<h2 id="orgb963d52">The West Coast</h2>
<div class="outline-text-2" id="text-orgb963d52">
<p>
I've been to every place you've heard of, and many you'll never visit. Not literally, but it's much more than most people will ever visit.
</p>
</div>
</div>
<div id="outline-container-org878ce18" class="outline-2">
<h2 id="org878ce18">The Prairie Provinces</h2>
<div class="outline-text-2" id="text-org878ce18">
<p>
I've only spent a few brief months living here so I can't say I know the area as well as other regions.
</p>
</div>
</div>
<div id="outline-container-orgc257b7a" class="outline-2">
<h2 id="orgc257b7a">Central Canada</h2>
<div class="outline-text-2" id="text-orgc257b7a">
<p>
This is where I currently live.
</p>
</div>
</div>
<div id="outline-container-orge335f8a" class="outline-2">
<h2 id="orge335f8a">The Atlantic Region</h2>
<div class="outline-text-2" id="text-orge335f8a">
<p>
I was lucky to work for a company that was stationed in the central part of Newfoundland aptly name Central for about 6 months.
</p>
</div>
</div>
<div id="outline-container-org4d41252" class="outline-2">
<h2 id="org4d41252">The North</h2>
<div class="outline-text-2" id="text-org4d41252">
<p>
This experience was like something out a movie. There is something special about places as vast as the northern reaches of Canada. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
